uhnp/src/Documents/УправлениеПериодомСценария/УправлениеПериодомСценария.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УправлениеПериодомСценария</name>
  <posting>Deny</posting>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяПериодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСценария</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСценарияОкончание</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияОрганизационнойСтруктуры</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроцесса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьЛимиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСкользящегоПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаАктуализации</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийГоризонт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРасширеннаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗапускатьПроцесс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭкземплярПроцесса</name>
    <type>
      <types>DocumentRef.ЭкземплярПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаНачалаСверкиВГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ДатаОкончанияСверкиВГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПервоеПрименение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыОтчетовДляУстановкиЛимитов</name>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>CatalogRef.ВидыОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПериодическиеКурсы</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКурсЗаПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКурсЗаПериодМСФО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсНаНачалоПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсНаКонецПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКурсЗаПредыдущийПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсНаКонецПредыдущегоПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/СтатусыПериодовСценариев/СтатусыПериодовСценариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПериодовСценариев</name>
  <resources>
    <name>СтатусПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусБлокировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияРегламента</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </resources>
  <attributes>
    <name>УправлениеПериодомСценария</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сценарии</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Периоды</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организации</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПериодическиеКурсы/ПериодическиеКурсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПериодическиеКурсы</name>
  <resources>
    <name>СреднийКурсЗаПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийКурсЗаПериодМСФО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсНаНачалоПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсНаКонецПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийКурсЗаПредыдущийПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсНаКонецПредыдущегоПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийКурсЗаПериодЦБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийКурсЗаПредыдущийПериодЦБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодКурса</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/РежимыПланирования/РежимыПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыПланирования</name>
  <enumValues>
    <name>СкользящееПланирование</name>
  </enumValues>
  <enumValues>
    <name>ПланированиеНаИнтервал</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/УправлениеПериодомСценария/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Открывает следующий период сценария
//
Процедура ОткрытьСледующийПериод() Экспорт
	
	Если РежимСкользящегоПлана Тогда
		ОткрытьСледующийПериодСкользящееПланирование();
	Иначе
		ОткрытьСледующийПериодФиксированныйГоризонт();
	КонецЕсли;
	
КонецПроцедуры

// Открывает предыдущий период сценария
//
Процедура ОткрытьПредыдущийПериод() Экспорт
	
	ОткрытьПредыдущийПериодСкользящееПланирование();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ШапкаОшибки = НСтр("ru = '%Объект% не может быть записан:'");
	ШапкаОшибки = СтрЗаменить(ШапкаОшибки, "%Объект%", Строка(ЭтотОбъект));
	
	Если НЕ  ЗначениеЗаполнено(ПериодСценарияОкончание) Тогда
		ПериодСценарияОкончание = ПериодСценария;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПериодСценария) Тогда
		ТекущаяПериодичность = ПериодСценария.Периодичность;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущаяПериодичность) Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = ' - не заполнено значение обязательного реквизита ""Периодичность""!'"), Отказ, ШапкаОшибки);
	КонецЕсли;
	
	РежимСкользящегоПлана = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сценарий,"РежимПланирования") = Перечисления.РежимыПланирования.СкользящееПланирование;
	
	// Проверки для режима скользящего планирования
	Если РежимСкользящегоПлана Тогда
		
		// Скользящее планирование не совместимо с процессами подготовки отчетности.
		Если ВерсияОрганизационнойСтруктуры.ИспользоватьПроцесс Тогда
			
			ТекстСообщения = Нстр("ru = 'В сценарии ""%1"" установлен режим планирования ""%2"". В Регламенте ""%3"" нельзя использовать процесс.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
				Сценарий, Перечисления.РежимыПланирования.СкользящееПланирование, ВерсияОрганизационнойСтруктуры);
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения, Отказ);
			
		КонецЕсли;
		
		// В системе может быть только один документ по выбранному сценарию скользящего плана.
		Если Не ПометкаУдаления Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	УправлениеПериодомСценария.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.УправлениеПериодомСценария КАК УправлениеПериодомСценария
				|ГДЕ
				|	УправлениеПериодомСценария.Сценарий = &Сценарий
				|	И УправлениеПериодомСценария.ПометкаУдаления = ЛОЖЬ
				|	И УправлениеПериодомСценария.Ссылка <> &Ссылка";
			
			Запрос.УстановитьПараметр("Сценарий",Сценарий);
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Уже существует документ скользящего планирования по данному сценарию.'"), Отказ, ШапкаОшибки);	
			КонецЦикла;
			
		КонецЕсли;
		
		// При первой инициалзации скользящего планирования, установим окно на начало периода документа
		Если Не ЗначениеЗаполнено(ГраницаАктуализации) Тогда
			ГраницаАктуализации = ПериодСценария;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РежимСкользящегоПлана Тогда
		Если Сценарий <> Ссылка.Сценарий 
			ИЛИ ПериодСценария <> Ссылка.ПериодСценария 
			ИЛИ ПериодСценарияОкончание <> Ссылка.ПериодСценарияОкончание
			ИЛИ ВерсияОрганизационнойСтруктуры <> Ссылка.ВерсияОрганизационнойСтруктуры Тогда
			ОчиститьСтатусыПериодовСценариев(Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьНаличиеДругихДокументовДляДанногоПериодаИСценария(Отказ,ШапкаОшибки);
	
	Если НЕ ПометкаУдаления Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ПодсистемыУХ.ПланированиеИКонтрольСлужебный") Тогда
			ПараметрыМетода = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭтотОбъект);
			ПараметрыМетода.Добавить(Отказ);
			ОбщегоНазначения.ВыполнитьМетодКонфигурации("УстановкаЛимитовУХ.ПроверкаУстановкиЛимитовПередЗаписьюУправлениеПериодомСценария", ПараметрыМетода);
			Отказ = ПараметрыМетода[1];
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПериодСценарияОкончание) Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = ' - Не выбран период окончания действия документа. Запись документа невозможна'"), Отказ, ШапкаОшибки);
	КонецЕсли;
	Если НЕ ТекущаяПериодичность = ПериодСценарияОкончание.Периодичность ИЛИ НЕ ТекущаяПериодичность = ПериодСценария.Периодичность Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = ' - Не совпадают периодичности сценария и периодов действия документа. Запись документа невозможна'"), Отказ, ШапкаОшибки);
	КонецЕсли;
	Если ПериодСценарияОкончание.ДатаНачала < ПериодСценария.ДатаНачала Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = ' - Период окончания не может быть меньше периода начала действия документа. Запись документа невозможна'"), Отказ, ШапкаОшибки);
	КонецЕсли;
	
	Если ПериодЗакрыт <> Ссылка.ПериодЗакрыт Тогда
		ДополнительныеСвойства.Вставить("ЗакрытиеПериода", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаШаблона = Нстр("ru = '%1 не может быть записан:'");
	
	ШапкаОшибки = "";
	Если ЗначениеЗаполнено(СтрокаШаблона) тогда
		ШапкаОшибки = СтрШаблон(СтрокаШаблона, ЭтотОбъект);
	КонецЕсли;
	
	ОбновитьСтатусыПериодовСценариев(Отказ);
	
	ЗаполнитьПериодическиеКурсыПоУмолчанию();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПериодЗакрыт = Ложь;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьСтатусыПериодовСценариев(Отказ)
	
	Если ПометкаУдаления Тогда
		ОчиститьСтатусыПериодовСценариев(Отказ);
	КонецЕсли;
	
	тПериодыОрганизации = УправлениеОтчетамиУХ.ПолучитьАналитикиТекущегоГоризонта(Ссылка,
		ПериодСценария, ПериодСценарияОкончание, Сценарий, ВерсияОрганизационнойСтруктуры);
		
	Если ДополнительныеСвойства.Свойство("ЗакрытиеПериода") Тогда
		тПериодыОрганизации.ЗаполнитьЗначения(?(ПериодЗакрыт, 1, 0), "СтатусБлокировки");
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СтатусыПериодовСценариев.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сценарии.Установить(Сценарий);
	
	тПериоды = тПериодыОрганизации.Скопировать();
	тПериоды.Свернуть("Периоды");
	
	Для Каждого ПериодСценарияСтрока Из тПериоды Цикл
		НаборЗаписей.Отбор.Периоды.Установить(ПериодСценарияСтрока.Периоды);
		НаборЗаписей.Загрузить(тПериодыОрганизации.Скопировать(Новый Структура("Периоды", ПериодСценарияСтрока.Периоды)));
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = НСтр("ru = 'Не удалось записть набор записей регистра сведений ""Статусы периодов сценариев"", по причине: %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецПопытки
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьСтатусыПериодовСценариев(Отказ)
	
	// Очищаем данные текущего документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыПериодовСценариев.Сценарии,
		|	СтатусыПериодовСценариев.Периоды,
		|	СтатусыПериодовСценариев.Организации,
		|	СтатусыПериодовСценариев.УдалитьПроекты,
		|	СтатусыПериодовСценариев.СтатусПоказателя,
		|	СтатусыПериодовСценариев.СтатусБлокировки,
		|	СтатусыПериодовСценариев.ДатаЗакрытияПериода,
		|	СтатусыПериодовСценариев.ВерсияРегламента,
		|	СтатусыПериодовСценариев.УправлениеПериодомСценария
		|ИЗ
		|	РегистрСведений.СтатусыПериодовСценариев КАК СтатусыПериодовСценариев
		|ГДЕ
		|	СтатусыПериодовСценариев.УправлениеПериодомСценария = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Менеджер = РегистрыСведений.СтатусыПериодовСценариев.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер ,Выборка);
		Менеджер.Прочитать();
		Попытка
			Менеджер.Удалить();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстСообщения = НСтр("ru = 'Не удалось записть набор записей регистра сведений ""Статусы периодов сценариев"", по причине: %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецПопытки
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьНаличиеДругихДокументовДляДанногоПериодаИСценария(Отказ, ШапкаОшибки)
	
	// Проверяем, что не существует документа УОП пересекающегося с текущим диапазоном
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УправлениеПериодомСценария.Ссылка КАК Ссылка,
		|	УправлениеПериодомСценария.ТекущаяПериодичность КАК ТекущаяПериодичность
		|ИЗ
		|	Документ.УправлениеПериодомСценария КАК УправлениеПериодомСценария
		|ГДЕ
		|	УправлениеПериодомСценария.Сценарий = &Сценарий
		|	И НЕ УправлениеПериодомСценария.Ссылка = &Ссылка
		|	И УправлениеПериодомСценария.ПериодСценария.ДатаНачала <= &ДатаОкончания
		|	И УправлениеПериодомСценария.ПериодСценарияОкончание.ДатаНачала >= &ДатаНачала
		|	И УправлениеПериодомСценария.ПометкаУдаления = ЛОЖЬ
		|	И УправлениеПериодомСценария.ТекущаяПериодичность = &ТекущаяПериодичность";
	
	Запрос.УстановитьПараметр("Сценарий",       Сценарий);
	Запрос.УстановитьПараметр("Ссылка",         Ссылка);
	Запрос.УстановитьПараметр("ДатаНачала",ПериодСценария.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",ПериодСценарияОкончание.ДатаНачала);
	Запрос.УстановитьПараметр("ТекущаяПериодичность",ТекущаяПериодичность);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = ' Уже существует другой документ с пересекающимся периодом '"),
			Отказ, ШапкаОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПериодическиеКурсыПоУмолчанию()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПериодическиеКурсы.СреднийКурсЗаПериод КАК СреднийКурсЗаПериод
		|ИЗ
		|	РегистрСведений.ПериодическиеКурсы КАК ПериодическиеКурсы
		|ГДЕ
		|	ПериодическиеКурсы.Сценарий = &Сценарий
		|	И ПериодическиеКурсы.ПериодКурса = &ПериодКурса";
	
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.УстановитьПараметр("ПериодКурса",ПериодСценария);
	
	Результат=Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПодпериодов = ПериодыУХ.ПолучитьПодчиненныеПериодыТаблица(ПериодСценария, ПериодСценарияОкончание);
	
	Для Каждого СтрПериод Из ТаблицаПодпериодов Цикл
		
		ТаблицаКурсов = ОбщегоНазначенияСерверУХ.ЗаполнитьПериодическиеКурсыВалют(СтрПериод.ПериодКурса, Сценарий, ПериодСценарияОкончание);
		
		НаборЗаписей=РегистрыСведений.ПериодическиеКурсы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сценарий.Установить(Сценарий);
		НаборЗаписей.Отбор.ПериодКурса.Установить(СтрПериод.ПериодКурса);
		
		Для Каждого Элемент Из ТаблицаКурсов Цикл
			
			ТекСтрока = НаборЗаписей.Добавить();
			ТекСтрока.Валюта		= Элемент.Валюта;
			ТекСтрока.Кратность		= Элемент.Кратность;
			Текстрока.ПериодКурса	= СтрПериод.ПериодКурса;
			Текстрока.Сценарий		= Сценарий;
			
			ТекСтрока.СреднийКурсЗаПериод				= Элемент.СреднийКурсЗаПериод;
			ТекСтрока.СреднийКурсЗаПериодМСФО			= Элемент.СреднийКурсЗаПериодМСФО;	
			ТекСтрока.КурсНаНачалоПериода				= Элемент.КурсНаНачалоПериода;	
			ТекСтрока.КурсНаКонецПериода				= Элемент.КурсНаКонецПериода;	
			ТекСтрока.КурсНаКонецПредыдущегоПериода		= Элемент.КурсНаКонецПредыдущегоПериода;	
			ТекСтрока.СреднийКурсЗаПредыдущийПериод		= Элемент.СреднийКурсЗаПредыдущийПериод;
			ТекСтрока.СреднийКурсЗаПериодЦБ				= Элемент.СреднийКурсЗаПериодЦБ;
			ТекСтрока.СреднийКурсЗаПредыдущийПериодЦБ	= Элемент.СреднийКурсЗаПредыдущийПериодЦБ;			
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьСледующйДокументПериодичностьНеОпределена(НовыйПериод, НовыйПериодОкончание)

	// Определим документ управления периодом сценария для нового периода и, при необходимости, создадим его
	
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УправлениеПериодомСценария.Ссылка КАК УправлениеПериодом
	|ИЗ
	|	Документ.УправлениеПериодомСценария КАК УправлениеПериодомСценария
	|ГДЕ
	|	УправлениеПериодомСценария.Сценарий = &СценарийПлан
	|	И УправлениеПериодомСценария.ПериодСценария = &НовыйПериод";
	
	Запрос.УстановитьПараметр("НовыйПериод", НовыйПериод);
	Запрос.УстановитьПараметр("СценарийПлан", Сценарий);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		
		НовыйПериодСценарий = Результат.УправлениеПериодом;
		
	Иначе
		
		// Создадим новый документ "Управление периодом сценария"
		НовыйПериодСценарий = УправлениеРабочимиПроцессамиУХ.ОпределитьДокументУправленияПериодомСценария(Сценарий,НовыйПериод,Ссылка);
		Если НовыйПериодСценарий = Неопределено Тогда
			ПериодОткрыт = Ложь;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьСледующйДокументПериодичностьОпределена(НовыйПериод, НовыйПериодОкончание)
	
	// Определим документ управления периодом сценария для нового периода и, при необходимости, создадим его
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УправлениеПериодомСценария.Ссылка КАК УправлениеПериодом
		|ИЗ
		|	Документ.УправлениеПериодомСценария КАК УправлениеПериодомСценария
		|ГДЕ
		|	УправлениеПериодомСценария.Сценарий = &СценарийПлан
		|	И УправлениеПериодомСценария.ПериодСценария = &НовыйПериод";
	
	Запрос.УстановитьПараметр("НовыйПериод", ПериодСценарияОкончание);
	Запрос.УстановитьПараметр("СценарийПлан", Сценарий);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		НовыйПериодСценарий = Результат.УправлениеПериодом;
		
	Иначе
		
		// Создадим новый документ "Управление периодом сценария"
		НовыйПериодСценарий=УправлениеРабочимиПроцессамиУХ.ОпределитьДокументУправленияПериодомСценария(Сценарий,НовыйПериод,Ссылка,НовыйПериодОкончание);
		Если НовыйПериодСценарий=Неопределено Тогда
			ПериодОткрыт=Ложь;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьСледующийПериодСкользящееПланирование()
	
	ШагСкользящегоПлана = 1;
	
	// Если не заполняли границу ранее
	Если Не ЗначениеЗаполнено(ГраницаАктуализации) Тогда
		ГраницаАктуализации = ПериодСценария;
	КонецЕсли;
	
	ГраницаАктуализацииДоИзменения = ГраницаАктуализации;
	
	ГраницаАктуализации = УправлениеОтчетамиУХ.ПолучитьСледующийПериод(ГраницаАктуализации,ШагСкользящегоПлана);
	ПериодСценарияОкончание = УправлениеОтчетамиУХ.ПолучитьСледующийПериод(ПериодСценарияОкончание,ШагСкользящегоПлана);
	
	// Открываем для изменения периоды после границы
	тПериодыОрганизацииПолныйСрез = УправлениеОтчетамиУХ.ПолучитьАналитикиТекущегоГоризонта(Ссылка,
		ГраницаАктуализацииДоИзменения,ПериодСценарияОкончание,Сценарий,ВерсияОрганизационнойСтруктуры);
	
	НаборЗаписей = РегистрыСведений.СтатусыПериодовСценариев.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сценарии.Установить(Сценарий);
	
	ТЗПериодов = тПериодыОрганизацииПолныйСрез.Скопировать();
	ТЗПериодов.Свернуть("Периоды");
	
	Для Каждого СтрПериод Из тПериодыОрганизацииПолныйСрез Цикл
		СтрПериод.СтатусБлокировки = 0;
	КонецЦикла;
	
	Для Каждого ПериодСценарияСтрока Из ТЗПериодов Цикл
		
		НаборЗаписей.Отбор.Периоды.Установить(ПериодСценарияСтрока.Периоды);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Загрузить(тПериодыОрганизацииПолныйСрез.Скопировать(Новый Структура("Периоды",ПериодСценарияСтрока.Периоды)));
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	// Закрываем для изменения периоды после границы
	тПериодыОрганизацииПолныйСрез = УправлениеОтчетамиУХ.ПолучитьАналитикиТекущегоГоризонта(Ссылка,
		ПериодСценария,ГраницаАктуализацииДоИзменения,Сценарий,ВерсияОрганизационнойСтруктуры);
	
	НаборЗаписей = РегистрыСведений.СтатусыПериодовСценариев.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сценарии.Установить(Сценарий);
	
	ТЗПериодов = тПериодыОрганизацииПолныйСрез.Скопировать();
	ТЗПериодов.Свернуть("Периоды");
	
	Для Каждого СтрПериод Из тПериодыОрганизацииПолныйСрез Цикл
		СтрПериод.СтатусБлокировки = 1;
	КонецЦикла;
	
	Для Каждого ПериодСценарияСтрока Из ТЗПериодов Цикл
		
		НаборЗаписей.Отбор.Периоды.Установить(ПериодСценарияСтрока.Периоды);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Загрузить(тПериодыОрганизацииПолныйСрез.Скопировать(Новый Структура("Периоды",ПериодСценарияСтрока.Периоды)));
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	Записать();
	
КонецПроцедуры	

Процедура ОткрытьПредыдущийПериодСкользящееПланирование()
	
	ШагСкользящегоПлана = 1;
	
	// Если не заполняли границу ранее
	Если Не ЗначениеЗаполнено(ГраницаАктуализации) Тогда
		ГраницаАктуализации = ПериодСценария;
	КонецЕсли;
	
	ГраницаАктуализацииДоИзменения = ГраницаАктуализации;
	
	ГраницаАктуализации = УправлениеОтчетамиУХ.ПолучитьСледующийПериод(ГраницаАктуализации,-1*ШагСкользящегоПлана);	 
	ПериодСценарияОкончание = УправлениеОтчетамиУХ.ПолучитьСледующийПериод(ПериодСценарияОкончание,-1*ШагСкользящегоПлана);
	
	// Вышли за изначальный диапазон УОП слева, изменим ПериодСценария
	Если ГраницаАктуализации.ДатаНачала < ПериодСценария.ДатаНачала Тогда
		ПериодСценария= УправлениеОтчетамиУХ.ПолучитьСледующийПериод(ПериодСценария,-1*ШагСкользящегоПлана);
	КонецЕсли;
	
	// Закрываем периоды до границы
	тПериодыОрганизацииПолныйСрез = УправлениеОтчетамиУХ.ПолучитьАналитикиТекущегоГоризонта(Ссылка,
		ПериодСценария,ГраницаАктуализации,Сценарий,ВерсияОрганизационнойСтруктуры);
	
	НаборЗаписей = РегистрыСведений.СтатусыПериодовСценариев.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сценарии.Установить(Сценарий);
	
	ТЗПериодов = тПериодыОрганизацииПолныйСрез.Скопировать();
	ТЗПериодов.Свернуть("Периоды");
	
	Для Каждого СтрПериод Из тПериодыОрганизацииПолныйСрез Цикл
		СтрПериод.СтатусБлокировки = 1;
	КонецЦикла;
	
	Для Каждого ПериодСценарияСтрока Из ТЗПериодов Цикл
		
		НаборЗаписей.Отбор.Периоды.Установить(ПериодСценарияСтрока.Периоды);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Загрузить(тПериодыОрганизацииПолныйСрез.Скопировать(Новый Структура("Периоды",ПериодСценарияСтрока.Периоды)));
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	// Открываем периоды после границы
	тПериодыОрганизацииПолныйСрез = УправлениеОтчетамиУХ.ПолучитьАналитикиТекущегоГоризонта(Ссылка,
		ГраницаАктуализации,ПериодСценарияОкончание,Сценарий,ВерсияОрганизационнойСтруктуры);
	
	НаборЗаписей = РегистрыСведений.СтатусыПериодовСценариев.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сценарии.Установить(Сценарий);
	
	ТЗПериодов = тПериодыОрганизацииПолныйСрез.Скопировать();
	ТЗПериодов.Свернуть("Периоды");
	
	Для Каждого СтрПериод Из тПериодыОрганизацииПолныйСрез Цикл
		СтрПериод.СтатусБлокировки = 0;
	КонецЦикла;
	
	Для Каждого ПериодСценарияСтрока Из ТЗПериодов Цикл
		
		НаборЗаписей.Отбор.Периоды.Установить(ПериодСценарияСтрока.Периоды);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Загрузить(тПериодыОрганизацииПолныйСрез.Скопировать(Новый Структура("Периоды",ПериодСценарияСтрока.Периоды)));
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	Записать();
	
КонецПроцедуры

Процедура ОткрытьСледующийПериодФиксированныйГоризонт()
	
	ПериодОткрыт=Истина;
	
	ПериодОтчета=ПериодСценария;
	
	// Определим следующий период планирования
	КоличествоПодпериодов =  УправлениеОтчетамиУХ.ПолучитьСмещениеПоИнтервалуПериодов(ПериодСценария,ПериодСценарияОкончание);
	
	НовыйПериод= УправлениеОтчетамиУХ.ПолучитьСледующийПериод(ПериодСценария,КоличествоПодпериодов);
	НовыйПериодОкончание= УправлениеОтчетамиУХ.ПолучитьСледующийПериод(ПериодСценарияОкончание,КоличествоПодпериодов);
	
	Если НЕ ЗначениеЗаполнено(НовыйПериод) Тогда
		Сообщить(НСтр("ru = 'Не удалось определить следующий период. Проверьте наличие соответствующего
		|элемента справочника ""Периоды"".'"), СтатусСообщения.Внимание);	
		ПериодОткрыт=Ложь;
		Возврат;
	КонецЕсли;

	// Определим документ управления периодом сценария для нового периода и, при необходимости, создадим его
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УправлениеПериодомСценария.Ссылка КАК УправлениеПериодом
		|ИЗ
		|	Документ.УправлениеПериодомСценария КАК УправлениеПериодомСценария
		|ГДЕ
		|	УправлениеПериодомСценария.Сценарий = &Сценарий
		|	И УправлениеПериодомСценария.ПериодСценария = &НовыйПериод
		|	И УправлениеПериодомСценария.ПериодСценарияОкончание = &ПериодСценарияОкончание";

	Запрос.УстановитьПараметр("НовыйПериод",НовыйПериод);
	Запрос.УстановитьПараметр("ПериодСценарияОкончание",НовыйПериодОкончание);
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Если ЗначениеЗаполнено(Результат.УправлениеПериодом) Тогда
			
			СтрокаШаблона = Нстр("ru = 'Документ Управление отчетным периодом по сценарию %1 за период %2-%3 уже создан.'");
			
			Если ЗначениеЗаполнено(СтрокаШаблона) Тогда
				Сообщить(СтрШаблон(СтрокаШаблона, Сценарий, НовыйПериод, НовыйПериодОкончание));
			КонецЕсли;
			
			ПериодОткрыт=Истина;
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Попытка
			
			НовыйДокумент=Ссылка.Скопировать();
			НовыйДокумент.Дата=ТекущаяДата();
			НовыйДокумент.УстановитьНовыйНомер();
			НовыйДокумент.ПериодСценария=НовыйПериод;
			НовыйДокумент.ПериодСценарияОкончание=НовыйПериодОкончание;
			НовыйДокумент.Записать();
			
			СтрокаШаблона = Нстр("ru = 'Документ Управление отчетным периодом по сценарию %1 за период %2-%3 успешно создан.'");
			
			Если ЗначениеЗаполнено(СтрокаШаблона) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(СтрокаШаблона, Сценарий, НовыйПериод, НовыйПериодОкончание));
			КонецЕсли;
			
		Исключение
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
